The_gossip_project/app/controllers/gossip_controller.rb

SELECT "gossips".* FROM "gossips" ORDER BY "gossips"."created_at" DESC
---
  def index
    @gossips = Gossip.order(created_at: :desc).all